{
    "text": "US stocks plunge as fears grow over economic slowdown\n2 hours ago\nShare\nSave\nAli Abbas Ahmadi\nBBC News\nReuters\nThe market drop comes after President Trump said the US economy was \"in a period of transition\"\nUS stocks plunged on Monday as fears grew over an economic slowdown, after President Donald Trump did not rule out his tariffs triggering a recession.\nThe Nasdaq sank by 4.0% at the close of trading, its largest single-day loss since 2022, and there were heavy losses on other markets with tech stocks seeing the largest drops.\nTesla shares fell about 15.4%, while chipmaker Nvidia was down more than 5%. Other major tech stocks including Meta, Amazon and Alphabet also sank.\nThe S&P 500 Index slid 2.7%, and the Dow Jones Industrial Average dropped 2.1%.\nIt followed Trump's comment that the US economy was in a period of transition, after he was asked about concerns over a potential recession.\nSpeaking to Fox News in an interview broadcast on Sunday but recorded on Thursday, Trump appeared to acknowledge the concerns. \"I hate to predict things like that,\" he said. \"There is a period of transition because what we're doing is very big. We're bringing wealth back to America. That's a big thing.\"\nThe president has not commented on the economy since that interview aired, but his top officials and advisers have sought to assuage fears.\nStocks slide as Trump warns of US economy 'transition'\nTrump expands exemptions from Canada and Mexico tariffs\nAfter trading closed on Monday, a White House official told reporters: \"We're seeing a strong divergence between [the] animal spirits of the stock market and what we're actually seeing unfold from businesses and business leaders.\"\n\"The latter is obviously more meaningful than the former on what's in store for the economy in the medium to long term,\" the official added.\nIn a separate statement later in the day, White House spokesman Kush Desai said \"industry leaders\" had responded to Trump's agenda, including tariffs, \"with trillions in investment commitments\".\nThere are growing fears among economic analysts, however, that growth will slow and prices will rise.\nLast week, the main US markets fell back to the level seen before Trump's election victory last November, which had initially been welcomed by investors due to hopes of tax cuts and lighter regulation.\nInvestors fear Trump's tariffs - which are taxes on goods applied as they enter the country - will lead to higher prices and ultimately dent growth in the world's largest economy.\n\"The level of tariffs that Trump is imposing, I think no doubt, will have to cause inflation somewhere down the line,\" Rachel Winter, investment manager at Killik & Co, told the Today programme.\nThe president introduced the measures after accusing China, Mexico and Canada of not doing enough to end the flow of illegal drugs and migrants into the US. The three countries have rejected the accusations.\nThe slump in Tesla's share price is linked to uncertainty over those tariff plans, which could hurt Canada and Mexico, key markets for car parts. Higher tariffs could push up production costs and raise prices.\nEconomist Mohamed El-Erian said investors were initially optimistic about Trump's plans for de-regulation and lower taxes, while under-estimating the likelihood of a trade war.\nHe said the recent falls in the stock market, which started last week, reflect the adjustment of those bets.\n\"It's a complete change in what the market expected,\" he added, noting that investors are also responding to signs that businesses and households are starting to hold off on spending due to uncertainty, which could hurt economic growth.\nBut Kevin Hassett, an economic adviser to President Trump, has pushed back against those projecting this bleak outlook.\nIn an interview with CNBC, Hassett said there were many reasons to be optimistic about the US economy and that that tariffs imposed on Canada, Mexico and China were already bringing manufacturing and jobs to the United States.\n\"There are a lot of reasons to be extremely bullish about the economy going forward,\" he said.\nHe admitted there were some \"blips in the data\" for this quarter, which he pinned on the timing of Trump's tariffs and the \"Biden inheritance\".\nMore than 80% of USAID programmes 'officially ending'\nBourbon is out, patriotism is in - How Canadians are facing Trump threats head on\nOntario says it will slap a 25% surcharge on US-bound electricity\nStock markets\nUnited States",
    "metadata": {
        "title": "US stocks plunge as fears grow over impact of tariffs"
    }
}